{"posts":[{"title":"Pensando no mundo","text":"Bem vindos! Este é meu primeiro post aqui e quero que vocês saibam que caminho iremos trilhar juntos!Iremos falar desde a melhor linguagem de programação para jogos até duvidas e problemas técnicos que um desenvolvedor pode enfrentar no dia a dia e como podemos desbloquear usando soluções inteligentes! Conteúdo simples e didáticoIremos Passar por conteúdos dos mais diversos! Desde os conteúdos mais simples como por exemplo sobre codigos javascript para iniciantes até assuntos mais complexos como por exemplo Design Patterns e muito clean code Tire suas duvidas técnicasDurante nossa jornada, falaremos sobre alternativas elegantes para resolver problemas complexos de forma que o código se torne simples e eficiente Desmistificaremos a tecnologia!Vamos conversar sobre tudo que o mundo da tecnologia nos provê e vamos quebrar barreiras de conhecimento que não deveriam existir Obrigado!Este Blog foi feito para você! Se você me acompanhou até aqui, considere para nos acompanhar pelo RSS usando o widget do Follow IT ao lado!","link":"/2022/12/08/hello-world/"},{"title":"Desvendando os mistérios do SCRUM","text":"Um breve resumoA metodologia ágil scrum é competitivamente melhor do que as demais tecnologias ágeis disponíveis no mercado. Mas como ela funciona exatamente? A metodologia agile scrum é um dos métodos de desenvolvimento mais utilizados atualmente. Ela tem permitido que as empresas se tornem bem sucedidas e introduzam produtos no mercado de forma mais oportuna e econômica. Entretanto, muitas pessoas não estão familiarizadas com o seu funcionamento, quais são os benefícios e as ferramentas utilizadas para sua implementação. Neste artigo vou explicar como funciona esta metodologia e os princípios-chave do scrum. O que é scrum ?A metodologia ágil Scrum é uma abordagem para o gerenciamento de projetos de software que se concentra em entregar valor para o cliente através da entrega contínua de pequenas partes do produto. Ela é baseada em um conjunto de valores, papéis, eventos, artefatos e regras definidas pelo framework Scrum. Seu usoScrum é usado principalmente em projetos de software, mas também pode ser aplicado a outras áreas, como gerenciamento de produtos, marketing e até mesmo finança a grande chave do scrumO scrum é acima de tudo, flexivel. Você pode utilizar apenas partes do scrum em seu projeto, ou até mesmo coisas adicionais, modifique até fazer sentido para o seu negócio. O Scrum é uma metodologia ágil que visa aumentar a performance e entrega dos times em pequenos blocos constantes de valor. Trazendo assim valor agregado ao produto de uma forma mais previsível. Como funciona?metodologia ágil Scrum é baseada em ciclos de trabalho curtos, chamados de “sprints”, que normalmente duram de duas a quatro semanas. Cada sprint começa com uma planejamento, seguida pelo desenvolvimento e teste do produto, e termina com uma revisão e uma demonstração do trabalho concluído para o cliente. Principais elementos Equipe Scrum: é composta por pessoas que trabalham juntas para entregar o produto. A equipe é altamente autônoma e cross-functional, o que significa que é responsável por todas as atividades necessárias para entregar o produto. Papéis Scrum: são os papéis específicos que existem dentro de uma equipe Scrum. O papel mais importante é o do Scrum Master, que é responsável por garantir que a equipe siga as regras do Scrum e remova quaisquer obstáculos que possam impedir o progresso. Outros papéis incluem o Product Owner, que é responsável por definir o que deve ser entregue, e os Developers, que são os membros da equipe responsáveis por desenvolver o produto. É importante lembrar que nem sempre os times scrum são compostos apenas de desenvolvedores de software, também tempos outros profissionais que façam sentido para o desenrolar do processo da sprint, como por exemplo, podemos ter Designers de UI/UX, SRE’s, QA’s, dentre outros das mais diversas profissões existentes. Artefatos Scrum: são os elementos tangíveis usados ​​durante o processo Scrum para ajudar a equipe a entregar o produto. Os principais artefatos são a Backlog do Produto, que é uma lista de tudo o que deve ser entregue, e o Sprint Backlog, que é uma lista de tarefas que a equipe planeja completar durante o sprint atual. Eventos Scrum(Também conhecido como cerimônias): são as reuniões regulares que ocorrem durante um sprint. Os principais eventos são a “Reunião de Planejamento do Sprint”, a “Reunião Diária Scrum” conhecida também como Daily e a “**Reunião de Revisão do **Sprint” que também é conhecida por reunião de retrospectiva ou simplesmente Retrô. ConclusãoO objetivo do scrum é gerenciar projetos e planejar sprints sem confusão ou mal-entendidos. O que acontece exatamente em uma equipe scrum. Como mencionei anteriormente, a metodologia ágil é mais flexível do que as metodologias tradicionais de gerenciamento de projetos, mas as metodologias ainda seguem certos princípios durante o curso do trabalho que melhor se ajustam a uma situação para alcançar os resultados esperados. Obrigado!Este Blog foi feito para você! Se você me acompanhou até aqui, considere para nos acompanhar pelo RSS usando o widget do Follow IT ao lado!","link":"/2022/12/29/scrum/"}],"tags":[{"name":"startup, webtools","slug":"startup-webtools","link":"/tags/startup-webtools/"},{"name":"scrum, agile","slug":"scrum-agile","link":"/tags/scrum-agile/"}],"categories":[{"name":"startups, webtools","slug":"startups-webtools","link":"/categories/startups-webtools/"},{"name":"scrum, scrum master, po, backlog, sprint","slug":"scrum-scrum-master-po-backlog-sprint","link":"/categories/scrum-scrum-master-po-backlog-sprint/"}],"pages":[]}